---
title: RebarFailures
classe: Autodesk.Revit.DB.BuiltInFailures+RebarFailures
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 67
---

# RebarFailures

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `FailureDefinitionId BarDiameterTooLarge { get; }` | `RebarFailures.BarDiameterTooLarge` | FailureDefinitionId |
| `FailureDefinitionId BarTypeDoesNotAllowHooksOfCurrentShape { get; }` | `RebarFailures.BarTypeDoesNotAllowHooksOfCurrentShape` | FailureDefinitionId |
| `FailureDefinitionId BendDiameterTooLarge { get; }` | `RebarFailures.BendDiameterTooLarge` | FailureDefinitionId |
| `FailureDefinitionId BendDiameterTooSmall { get; }` | `RebarFailures.BendDiameterTooSmall` | FailureDefinitionId |
| `FailureDefinitionId CannotCreateFreeFormSetDueToShortBar { get; }` | `RebarFailures.CannotCreateFreeFormSetDueToShortBar` | FailureDefinitionId |
| `FailureDefinitionId CannotKeepVariabilityOfRebarInGroup { get; }` | `RebarFailures.CannotKeepVariabilityOfRebarInGroup` | FailureDefinitionId |
| `FailureDefinitionId CannotPlaceRebar { get; }` | `RebarFailures.CannotPlaceRebar` | FailureDefinitionId |
| `FailureDefinitionId CannotPlaceRebarWarn { get; }` | `RebarFailures.CannotPlaceRebarWarn` | FailureDefinitionId |
| `FailureDefinitionId CannotSolveRebarShapeUsingDataFromDimension { get; }` | `RebarFailures.CannotSolveRebarShapeUsingDataFromDimension` | FailureDefinitionId |
| `FailureDefinitionId CannotSolveRebarWithDelayedConstraints { get; }` | `RebarFailures.CannotSolveRebarWithDelayedConstraints` | FailureDefinitionId |
| `FailureDefinitionId CantMakeFillets { get; }` | `RebarFailures.CantMakeFillets` | FailureDefinitionId |
| `FailureDefinitionId ChangeUnitsFormatWarn { get; }` | `RebarFailures.ChangeUnitsFormatWarn` | FailureDefinitionId |
| `FailureDefinitionId ClearPresentationForAllBarsInRebarSet { get; }` | `RebarFailures.ClearPresentationForAllBarsInRebarSet` | FailureDefinitionId |
| `FailureDefinitionId ConstraintForHandleIsDisabled { get; }` | `RebarFailures.ConstraintForHandleIsDisabled` | FailureDefinitionId |
| `FailureDefinitionId CoverTooLong { get; }` | `RebarFailures.CoverTooLong` | FailureDefinitionId |
| `FailureDefinitionId DelayedConstraintForHandle { get; }` | `RebarFailures.DelayedConstraintForHandle` | FailureDefinitionId |
| `FailureDefinitionId HideAllBarsInRebarSet { get; }` | `RebarFailures.HideAllBarsInRebarSet` | FailureDefinitionId |
| `FailureDefinitionId HostTopologyChange { get; }` | `RebarFailures.HostTopologyChange` | FailureDefinitionId |
| `FailureDefinitionId IncompleteShape { get; }` | `RebarFailures.IncompleteShape` | FailureDefinitionId |
| `FailureDefinitionId InvalidRebarHost { get; }` | `RebarFailures.InvalidRebarHost` | FailureDefinitionId |
| `FailureDefinitionId InvalidRebarHostFamilyCanHostRebarParam { get; }` | `RebarFailures.InvalidRebarHostFamilyCanHostRebarParam` | FailureDefinitionId |
| `FailureDefinitionId InvalidRebarHostNonConcrete { get; }` | `RebarFailures.InvalidRebarHostNonConcrete` | FailureDefinitionId |
| `FailureDefinitionId InvalidRebarHostNonStructural { get; }` | `RebarFailures.InvalidRebarHostNonStructural` | FailureDefinitionId |
| `FailureDefinitionId InvalidRebarHostWrongCategory { get; }` | `RebarFailures.InvalidRebarHostWrongCategory` | FailureDefinitionId |
| `FailureDefinitionId Inverted3dShape { get; }` | `RebarFailures.Inverted3dShape` | FailureDefinitionId |
| `FailureDefinitionId MaxHookExtensionMultiplierWarn { get; }` | `RebarFailures.MaxHookExtensionMultiplierWarn` | FailureDefinitionId |
| `FailureDefinitionId MissingCurrentConstraintForHandle { get; }` | `RebarFailures.MissingCurrentConstraintForHandle` | FailureDefinitionId |
| `FailureDefinitionId NoRebarSelected { get; }` | `RebarFailures.NoRebarSelected` | FailureDefinitionId |
| `FailureDefinitionId NoSurfPatternOnRebar { get; }` | `RebarFailures.NoSurfPatternOnRebar` | FailureDefinitionId |
| `FailureDefinitionId NoVisibleRebarHandle { get; }` | `RebarFailures.NoVisibleRebarHandle` | FailureDefinitionId |
| `FailureDefinitionId NoVisibleTargetsForCurrentConstraint { get; }` | `RebarFailures.NoVisibleTargetsForCurrentConstraint` | FailureDefinitionId |
| `FailureDefinitionId OutOfPlaneBendDiameterTooSmall { get; }` | `RebarFailures.OutOfPlaneBendDiameterTooSmall` | FailureDefinitionId |
| `FailureDefinitionId OutSideOfHost { get; }` | `RebarFailures.OutSideOfHost` | FailureDefinitionId |
| `FailureDefinitionId PathShapeFailure { get; }` | `RebarFailures.PathShapeFailure` | FailureDefinitionId |
| `FailureDefinitionId RebarArrayTooShort { get; }` | `RebarFailures.RebarArrayTooShort` | FailureDefinitionId |
| `FailureDefinitionId RebarBendRadiusTooBig { get; }` | `RebarFailures.RebarBendRadiusTooBig` | FailureDefinitionId |
| `FailureDefinitionId RebarBendRadiusTooBigWarn { get; }` | `RebarFailures.RebarBendRadiusTooBigWarn` | FailureDefinitionId |
| `FailureDefinitionId RebarConstraintWarning { get; }` | `RebarFailures.RebarConstraintWarning` | FailureDefinitionId |
| `FailureDefinitionId RebarContainerOutSideOfHostWarning { get; }` | `RebarFailures.RebarContainerOutSideOfHostWarning` | FailureDefinitionId |
| `FailureDefinitionId RebarDimensionalConstraintLost { get; }` | `RebarFailures.RebarDimensionalConstraintLost` | FailureDefinitionId |
| `FailureDefinitionId RebarEndTreatmentOverHook { get; }` | `RebarFailures.RebarEndTreatmentOverHook` | FailureDefinitionId |
| `FailureDefinitionId RebarHookOverEndTreatment { get; }` | `RebarFailures.RebarHookOverEndTreatment` | FailureDefinitionId |
| `FailureDefinitionId RebarHooksDontMatchShape { get; }` | `RebarFailures.RebarHooksDontMatchShape` | FailureDefinitionId |
| `FailureDefinitionId RebarIllegalBarType { get; }` | `RebarFailures.RebarIllegalBarType` | FailureDefinitionId |
| `FailureDefinitionId RebarInvalidDiameterRemoved { get; }` | `RebarFailures.RebarInvalidDiameterRemoved` | FailureDefinitionId |
| `FailureDefinitionId RebarMovedBarsOverlapped { get; }` | `RebarFailures.RebarMovedBarsOverlapped` | FailureDefinitionId |
| `FailureDefinitionId RebarNoConstraints { get; }` | `RebarFailures.RebarNoConstraints` | FailureDefinitionId |
| `FailureDefinitionId RebarNoMatchingHooks { get; }` | `RebarFailures.RebarNoMatchingHooks` | FailureDefinitionId |
| `FailureDefinitionId RebarShapeFailure { get; }` | `RebarFailures.RebarShapeFailure` | FailureDefinitionId |
| `FailureDefinitionId RebarShapeFailureCustomError { get; }` | `RebarFailures.RebarShapeFailureCustomError` | FailureDefinitionId |
| `FailureDefinitionId RebarShapeFailureCustomWarning { get; }` | `RebarFailures.RebarShapeFailureCustomWarning` | FailureDefinitionId |
| `FailureDefinitionId RebarShapeFailureDueToStaggerOffset { get; }` | `RebarFailures.RebarShapeFailureDueToStaggerOffset` | FailureDefinitionId |
| `FailureDefinitionId RebarSpacingTooSmall { get; }` | `RebarFailures.RebarSpacingTooSmall` | FailureDefinitionId |
| `FailureDefinitionId RebarTooShortImperial { get; }` | `RebarFailures.RebarTooShortImperial` | FailureDefinitionId |
| `FailureDefinitionId RebarTooShortMetric { get; }` | `RebarFailures.RebarTooShortMetric` | FailureDefinitionId |
| `FailureDefinitionId RemoveSpliceBetweenBars { get; }` | `RebarFailures.RemoveSpliceBetweenBars` | FailureDefinitionId |
| `FailureDefinitionId SketchDimensionsRemoved { get; }` | `RebarFailures.SketchDimensionsRemoved` | FailureDefinitionId |
| `FailureDefinitionId SketchDimsBWFRemoved { get; }` | `RebarFailures.SketchDimsBWFRemoved` | FailureDefinitionId |
| `FailureDefinitionId SketchFreeFormSet { get; }` | `RebarFailures.SketchFreeFormSet` | FailureDefinitionId |
| `FailureDefinitionId SketchNonPlanarFreeForm { get; }` | `RebarFailures.SketchNonPlanarFreeForm` | FailureDefinitionId |
| `FailureDefinitionId SpliceTypeWasDeleted { get; }` | `RebarFailures.SpliceTypeWasDeleted` | FailureDefinitionId |
| `FailureDefinitionId StandardHookBendDiameterTooLarge { get; }` | `RebarFailures.StandardHookBendDiameterTooLarge` | FailureDefinitionId |
| `FailureDefinitionId StandardHookBendDiameterTooSmall { get; }` | `RebarFailures.StandardHookBendDiameterTooSmall` | FailureDefinitionId |
| `FailureDefinitionId TooLargeNumberOfBars { get; }` | `RebarFailures.TooLargeNumberOfBars` | FailureDefinitionId |
| `FailureDefinitionId TooSmallNumberOfBars { get; }` | `RebarFailures.TooSmallNumberOfBars` | FailureDefinitionId |
| `FailureDefinitionId TrySmallerBarType { get; }` | `RebarFailures.TrySmallerBarType` | FailureDefinitionId |
| `FailureDefinitionId UnconstrainableRebarHandle { get; }` | `RebarFailures.UnconstrainableRebarHandle` | FailureDefinitionId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```